<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"951fcc2e199295a76175c238f30347e4d594acee14ede33048bbfde992f9ef76","plan_job_ref":"Job Pull Request Checks #3357 at https://github.com/GSA-TTS/FAC/actions/runs/10057334845","plan_out_hash":"b95f27794a291978ab3fa48bbb57c4e9cbccf423440b8ee85531bdc0c7fef17b","plan_hash":"5674f5c2eac3934a54d9752ac30dec7d9df47e000a269889fa1a578318ebb5c8","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.production.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
!~      docker_image                    = "ghcr.io/gsa-tts/fac/postgrest@sha256:08852a35ccf68490cf974e2b1a47d19480457c24b2244fa9f302ed785bd89462" -> "ghcr.io/gsa-tts/fac/postgrest@sha256:c15b1c1cfe03f3b974319ca3df8702aee908f2bd588f8061b0b1e803d7d3a61d"
        id                              = "70ac44be-3507-4867-a75f-c2d1ab12ee89"
        name                            = "postgrest"
#        (17 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:ba95b2eab2464f762071de942b60190be73c901a17a143b234ac3a53dc947d68" -> "ghcr.io/gsa-tts/fac/clamav@sha256:ad305d45cd4b00de8cb2fcb91bc342b994adcbf6028de6f36efeaec3ca48247e"
        id                              = "5d0afa4f-527b-472a-8671-79a60335417f"
        name                            = "fac-av-production"
#        (17 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:ba95b2eab2464f762071de942b60190be73c901a17a143b234ac3a53dc947d68" -> "ghcr.io/gsa-tts/fac/clamav@sha256:ad305d45cd4b00de8cb2fcb91bc342b994adcbf6028de6f36efeaec3ca48247e"
        id                              = "6b0ce685-a80c-4feb-9ed6-49c6427efdb8"
        name                            = "fac-av-production-fs"
#        (17 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
        id                              = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
        name                            = "https-proxy"
!~      source_code_hash                = "9fcf4a7f6abfc9a220de2b8bb97591ab490a271ac0933b984f606f645319e1a4" -> "9b63bf9766c73480bf1c2385e259b1321988ede71a7b68ebe5c451d9ff6bf1c1"
#        (21 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.newrelic.newrelic_one_dashboard.log_review_dashboard will be created
+   resource "newrelic_one_dashboard" "log_review_dashboard" {
+       account_id  = (known after apply)
+       guid        = (known after apply)
+       id          = (known after apply)
+       name        = "FAC Log Review (production)"
+       permalink   = (known after apply)
+       permissions = "public_read_only"

+       page {
+           guid = (known after apply)
+           name = "FAC Log Review"

+           widget_billboard {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Submission Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "From Transaction SELECT count(*) as 'Submissions' WHERE appName = 'gsa-fac-production' and request.method = 'POST' and request.uri like '/audit/submission/%' since 1 week ago"
                }
            }
+           widget_billboard {
+               column         = 4
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Excel Uploads"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT count(*) AS 'Total uploads', average(apm.service.transaction.duration) AS 'Average time (s)' WHERE appName = 'gsa-fac-production' AND path LIKE 'audit.views.views:ExcelFileHandlerView.post'"
                }
            }
+           widget_billboard {
+               column         = 7
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Single Audit Report Uploads"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT count(*) AS 'Total uploads', average(apm.service.transaction.duration) AS 'Average time (s)' WHERE appName = 'gsa-fac-production' AND path LIKE 'audit.views.upload_report_view:UploadReportView.post'"
                }
            }
+           widget_billboard {
+               column         = 10
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Global Requests (Non-Upload)"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT count(*) AS 'Total requests', average(apm.service.transaction.duration) * 1000 AS 'Average time (ms)' WHERE appName = 'gsa-fac-production' AND path NOT LIKE '%ExcelFileHandlerView.post' AND path NOT LIKE '%UploadReportView.post'"
                }
            }
+           widget_billboard {
+               column         = 9
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 4
+               title          = "Infected Files Detected"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) AS 'Infected Files' FROM Log WHERE tags.space_name = 'production' and message LIKE '%ScanResult.INFECTED%'"
                }
            }
+           widget_billboard {
+               column         = 9
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 5
+               title          = "Django /admin/login/ Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(`message` as `/admin/login/ hits`) FROM Log WHERE `message` LIKE 'app.fac.gov%/admin/login%' SINCE 7 days ago"
                }
            }
+           widget_billboard {
+               column         = 9
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 6
+               title          = "production api.sam.gov Connection Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) AS 'api.sam.gov connections' FROM Log WHERE `entity.name` = 'gsa-fac-production' AND allColumnSearch('api.sam.gov', insensitive: true) SINCE 7 DAYS AGO"
                }
            }
+           widget_billboard {
+               column         = 9
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 7
+               title          = "production login.gov Connection Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) AS 'login.gov connections' FROM Log WHERE `entity.name` = 'gsa-fac-production' AND allColumnSearch('/api/openid_connect/userinfo', insensitive: true) SINCE 7 DAYS AGO"
                }
            }

+           widget_log_table {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 6
+               title          = "production api.sam.gov Connections"
+               width          = 8

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT `message` FROM Log WHERE `entity.name` = 'gsa-fac-production' AND allColumnSearch('api.sam.gov', insensitive: true) SINCE 7 DAYS AGO"
                }
            }
+           widget_log_table {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 7
+               title          = "production login.gov Connections"
+               width          = 8

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT `message` FROM Log WHERE `entity.name` = 'gsa-fac-production' AND allColumnSearch('/api/openid_connect/userinfo', insensitive: true) SINCE 7 DAYS AGO"
                }
            }

+           widget_stacked_bar {
+               column         = 1
+               height         = 4
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 3
+               title          = "500 Error Code"
+               width          = 12

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE response.status = '500' and appName = 'gsa-fac-production' SINCE 1 week AGO TIMESERIES"
                }
            }
+           widget_stacked_bar {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 4
+               title          = "Login Requests"
+               width          = 8

+               colors {
+                   color = "#00ff04"

+                   series_overrides {
+                       color       = "#00ff04"
+                       series_name = "/openid/login/"
                    }
                }

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE request.uri = '/openid/login/' and appName = 'gsa-fac-production' SINCE 1 week AGO TIMESERIES"
                }
            }
+           widget_stacked_bar {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 5
+               title          = "Logout Requests"
+               width          = 8

+               colors {
+                   color = "#ff0000"

+                   series_overrides {
+                       color       = "#ff0000"
+                       series_name = "/openid/logout/"
                    }
                }

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE request.uri = '/openid/logout/' and appName = 'gsa-fac-production' SINCE 1 week AGO TIMESERIES"
                }
            }
        }
    }

Plan: 1 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.domain.cloudfoundry_service_instance.external_domain_instance,
  on /tmp/terraform-data-dir/modules/domain/domain/main.tf line 45, in resource "cloudfoundry_service_instance" "external_domain_instance":
  45:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 6 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3357](https://github.com/GSA-TTS/FAC/actions/runs/10057334845)